Revit 2025 API
WorksetKind Enumeration
 Indicates one of the standard kinds of workset (as available in the UI).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WorksetKind
Public Enumeration WorksetKind
public enum class WorksetKind
type WorksetKind
Members
Member name | Value | Description
OtherWorkset | 0 |  Any workset which is not one of the standard types included in this enum.
FamilyWorkset | 1 |  Workset containing a family.
ViewWorkset | 2 |  Workset containing a view.
StandardWorkset | 3 |  Workset containing a standard.
UserWorkset | 4 |  Workset defined by users, including the two default worksets created by Revit
See Also
Reference
Autodesk.Revit.DB Namespace